package tw.edu.ncu.cc.ncubusdrawerver;

public class Constant {

    //Data source new
    public static final String[] urls = {
            "http://ebus.tycg.gov.tw/NewTaoyuan/PDA/businfo.aspx?Routeid=3220&GO_OR_BACK=1&Line=1&lang=Cht",//132
            "http://ebus.tycg.gov.tw/NewTaoyuan/PDA/businfo.aspx?Routeid=3222&GO_OR_BACK=1&Line=1&lang=Cht",//132_A
            "http://ebus.tycg.gov.tw/NewTaoyuan/PDA/businfo.aspx?Routeid=133&GO_OR_BACK=1&Line=2&lang=Cht",//133
            "http://ebus.tycg.gov.tw/NewTaoyuan/PDA/businfo.aspx?Routeid=3221&GO_OR_BACK=1&Line=2&lang=Cht",//172去程
            "http://ebus.tycg.gov.tw/NewTaoyuan/PDA/businfo.aspx?Routeid=3221&GO_OR_BACK=2&Line=2&lang=Cht",//172返程
            "http://www.taiwanbus.tw/app_api/SP_PredictionTime.ashx?routeNo=9025&branch=0&goBack=1&Lang=&Source=w",//9025往台北
            "http://www.taiwanbus.tw/app_api/SP_PredictionTime.ashx?routeNo=9025&branch=0&goBack=2&Lang=&Source=w",//9025往中壢
            "http://www.taiwanbus.tw/app_api/SP_PredictionTime.ashx?routeNo=9025&branch=A&goBack=1&Lang=&Source=w",//9025往台北(繞駛中央大學)
            "http://www.taiwanbus.tw/app_api/SP_PredictionTime.ashx?routeNo=9025&branch=A&goBack=2&Lang=&Source=w",//90252往中壢(繞駛中央大學)
    };

    //Bus stop locations

    // latitudes
    public static final Double[] Latitudes_132 = {24.954290,24.955245,24.955089,24.955536,24.956159,24.956171,24.956737,24.957491,24.957195,24.957073,24.957321,24.958211,24.968297,24.968803,24.969863,24.968220,24.966707,24.967874};
    public static final Double[] Latitudes_132_A = {24.954290,24.955245,24.955089,24.955536,24.956159,24.956171,24.956737,24.957491,24.957195,24.957073,24.957321,24.958211,24.968297,24.968803,24.969863,24.968220,24.966707,24.967874,24.968156,24.971122,24.973490,24.976441,24.980667,24.983307,24.984401,24.999897,25.012790};
    public static final Double[] Latitudes_133 = {24.954290,24.953277, 24.955245, 24.955448,24.955089,24.955536,24.956159,24.956171,24.956737,24.957491,24.957195,24.957073,24.957321,24.958211,24.968297,24.968803,24.969863,24.968220,24.966707,24.967874,24.968156,};
    public static final Double[] Latitudes_172_GO = {24.954290, 24.953277, 24.955245, 24.955448, 24.955089, 24.955536, 24.956159, 24.956171, 24.956737, 24.957491, 24.957073, 24.957321, 24.959616, 24.962704, 24.968297, 24.968803, 24.969863, 24.968220, 24.966707, 24.967874, 24.968156, 24.971122, 24.973490, 24.976441, 24.980667, 24.983307, 24.984401, 24.992509, 24.999897, 25.012790};
    public static final Double[] Latitudes_172_BACK = {25.012790,24.999897,24.992509,24.984401,24.983307,24.980667,24.976441,24.973490,24.971122,24.968156,24.967874,24.966707,24.968220,24.969863,24.968803,24.968297,24.962704,24.959616,24.957321,24.957073,24.957491,24.956737,24.956171,24.956159,24.955536,24.955089,24.955448,24.955245,24.953277,24.954290};
    public static final Double[] Latitudes_9025_GO = {24.954290, 24.955536, 24.956159, 24.957073, 25.062640, 25.057622, 25.063270};
    public static final Double[] Latitudes_9025_BACK = {25.063270,25.057622,25.062640,24.957073,24.956159,24.955536,24.954290};
    public static final Double[] Latitudes_9025_GO_NCU = {24.954290, 24.955536, 24.956159, 24.957073, 24.968220, 24.968156, 25.062640, 25.057622, 25.063270 };
    public static final Double[] Latitudes_9025_BACK_NCU = {25.063270,25.057622,25.062640,24.968156,24.968220,24.957073,24.956159,24.955536,24.954290};

    //9025_GO bus stop longitudes
    public static final Double[] Longitudes_132 = {121.224074, 121.222024, 121.218941, 121.216393, 121.212946, 121.211129, 121.209474, 121.207376, 121.205781, 121.203629, 121.196377, 121.195256, 121.200389, 121.195513, 121.194150, 121.191082, 121.191613,121.195556};
    public static final Double[] Longitudes_132_A = {121.224074, 121.222024, 121.218941, 121.216393, 121.212946, 121.211129, 121.209474, 121.207376, 121.205781, 121.203629, 121.196377, 121.195256, 121.200389, 121.195513, 121.194150, 121.191082, 121.191613, 121.195556, 121.200336, 121.201240, 121.198756, 121.195976, 121.192537, 121.189496, 121.187720, 121.201410, 121.213947};
    public static final Double[] Longitudes_133 = {121.224074, 121.224094, 121.222024, 121.220092, 121.218941, 121.216393, 121.212946, 121.211129, 121.209474, 121.207376, 121.205781, 121.203629, 121.196377, 121.195256, 121.200389, 121.195513, 121.194150, 121.191082, 121.191613, 121.195556, 121.200336};
    public static final Double[] Longitudes_172_GO = {121.224074, 121.224094, 121.222024, 121.220092, 121.218941, 121.216393, 121.212946, 121.211129, 121.209474, 121.207376, 121.203629, 121.196377, 121.196792, 121.201362, 121.200389, 121.195513, 121.194150, 121.191082, 121.191613, 121.195556, 121.200336, 121.201240, 121.198756, 121.195976, 121.192537, 121.189496, 121.187720, 121.194651, 121.201410, 121.213947};
    public static final Double[] Longitudes_172_BACK = {121.213947, 121.201410, 121.194651, 121.187720, 121.189496,121.192537,121.195976,121.198756,121.201240,121.200336,121.195556,121.191613,121.191082,121.194150,121.195513,121.200389,121.201362,121.196792,121.196377,121.203629,121.207376,121.209474,121.211129,121.212946,121.216393,121.218941,121.220092,121.222024,121.224094,121.224074};
    public static final Double[] Longitudes_9025_GO = {121.224074, 121.216393, 121.212946, 121.203629, 121.533353, 121.542619, 121.551438};
    public static final Double[] Longitudes_9025_BACK = {121.551438,121.542619,121.533353,121.203629,121.212946,121.216393,121.224074};
    public static final Double[] Longitudes_9025_GO_NCU = {121.224074, 121.216393, 121.212946, 121.203629, 121.191082, 121.200336, 121.533353, 121.542619, 121.551438};
    public static final Double[] Longitudes_9025_BACK_NCU = {121.551438,121.542619,121.533353,121.200336,121.191082,121.203629,121.212946,121.216393,121.224074};


    //All bus stop latitudes
    public static final Double[][] latitudes = new Double[][]{Latitudes_132, Latitudes_132_A, Latitudes_133, Latitudes_172_GO,
            Latitudes_172_BACK, Latitudes_9025_GO, Latitudes_9025_BACK, Latitudes_9025_GO_NCU, Latitudes_9025_BACK_NCU};

    //ALL bus stop longitude
    public static final Double[][] longitudes = new Double[][]{Longitudes_132, Longitudes_132_A, Longitudes_133, Longitudes_172_GO,
            Longitudes_172_BACK, Longitudes_9025_GO, Longitudes_9025_BACK, Longitudes_9025_GO_NCU, Longitudes_9025_BACK_NCU};

    //Timetables
    public static final String[] timeTables ={
            //132  timeTables[0]
            "中壢端發車時間\n" +
            "06:30\t中壢開\t \t \n" +
            "07:10\t \t \t \n" +
            "07:30\t \t \t \n" +
            "07:50\t \t \t \n" +
            "08:10\t延駛高鐵桃園站\t  \n" +
            "08:30\t \t \t \n" +
            "08:50\t \t \t \n" +
            "09:10\t \t \t \n" +
            "09:30\t延駛高鐵桃園站\t \n" +
            "09:50\t延駛高鐵桃園站\t \n" +
            "10:10\t \t \t \n" +
            "10:30\t \t \t \n" +
            "10:50\t延駛高鐵桃園站\t \n" +
            "11:10\t \t \t \n" +
            "11:30\t延駛高鐵桃園站\t \n" +
            "11:50\t \t \t \n" +
            "12:10\t \t \t \n" +
            "12:30\t \t \t \n" +
            "12:50\t \t \t \n" +
            "13:10\t延駛高鐵桃園站 \n" +
            "13:30\t \t \t \n" +
            "13:50\t延駛高鐵桃園站 \n" +
            "14:10\t延駛高鐵桃園站 \n" +
            "14:30\t延駛高鐵桃園站 \n" +
            "14:50\t \t \t \n" +
            "15:10\t \t \t \n" +
            "15:30\t \t \t \n" +
            "15:50\t \t \t \n" +
            "16:10\t \t \t \n" +
            "16:30\t \t \t \n" +
            "16:50\t \t \t \n" +
            "17:10\t \t \t \n" +
            "17:30\t \t \t \n" +
            "17:50\t \t \t \n" +
            "18:10\t \t \t \n" +
            "18:30\t \t \t \n" +
            "18:50\t延駛高鐵桃園站\n" +
            "19:10\t \t \t \n" +
            "19:30\t \t \t \n" +
            "19:50\t \t \t \n" +
            "20:10\t \t \t \n" +
            "20:30\t \t \t \n" +
            "20:55\t \t \t \n" +
            "21:20\t \t \t \n" +
            "21:45\t \t \t \n" +
            "22:10\t ",

            //132經高鐵    timeTables[1]
            "中壢端發車時間\t \n" +
            "08:10\t延駛高鐵桃園站\n" +
            "09:30\t延駛高鐵桃園站\n" +
            "09:50\t延駛高鐵桃園站\n" +
            "10:50\t延駛高鐵桃園站\n" +
            "11:30\t延駛高鐵桃園站\n" +
            "13:10\t延駛高鐵桃園站\n" +
            "13:50\t延駛高鐵桃園站\n" +
            "14:10\t延駛高鐵桃園站\n" +
            "14:30\t延駛高鐵桃園站\n" +
            "18:50\t延駛高鐵桃園站",

            //133   timeTables[2]
            "平日\n" +
            "06:20\t10:45\t15:20\n" +
            "06:50\t11:45\t16:20\n" +
            "07:40\t12:25\t16:45\n" +
            "08:05\t13:20\t18:20\n" +
            "09:00\t14:05\t19:00\n" +
            "10:00\t14:40\n" +
            "\n" +
            "假日\n" +
            "07:00\t11:00\t15:00\n" +
            "08:00\t12:00\t16:00\n" +
            "09:00\t13:00\t17:00\n" +
            "10:00\t14:00\t17:55\n" +
            "\n" +
            "寒暑假 / 平日\t\n" +
            "07:00\t11:00\t15:00\n" +
            "08:00\t12:00\t16:35\n" +
            "09:00\t13:00\t17:25\n" +
            "10:00\t14:00\t18:25\n" +
            "\n" +
            "寒暑假 / 假日\t\n" +
            "07:00\t11:00\t15:00\n" +
            "08:00\t12:00\t16:00\n" +
            "09:00\t13:00\t17:00\n" +
            "10:00\t14:00\t17:55",

            //172   timeTables[3]
            "平日\n" +
            "中壢端\t中央大學\t高鐵端\n" +
            "07:20\t\t07:45\t\t      08:05\n" +
            "08:20\t\t08:45\t\t      09:10\n" +
            "12:20\t\t12:45\t\t      13:10\n" +
            "16:05\t\t16:30\t\t      17:05\n" +
            "17:05\t\t17:30\t\t      17:55\n" +
            "18:00\t\t18:25\t\t      18:50\n" +
            "\n" +
            "假日\n" +
            "中壢端\t中央大學\t高鐵端\n" +
            "08:20\t\t08:45\t\t      09:10\n" +
            "12:20\t\t12:45\t\t      13:10\n" +
            "16:45\t\t17:10\t\t      17:30\n" +
            "18:00\t\t18:25\t\t      18:50\n" +
            "18:25\t\t18:55\t\t      19:20\n" +
            "19:40\t\t20:05\t\t      20:30",

            //9025  timeTables[4]
            "平常日起點發車時間\n" +
            "0600\t1000\t1500\t1900\n" +
            "0620\t1030\t1530\t1930\n" +
            "0640\t1100\t1600\t2000\n" +
            "0700\t1130\t1630\t2030\n" +
            "0720\t1200\t1700\t2100\n" +
            "0740\t1230\t1720\t2130\n" +
            "0800\t1300\t1740\t2200\n" +
            "0830\t1330\t1800\t2230\n" +
            "0900\t1400\t1820\n" +
            "0930\t1430\t1840\n" +
            "\n" +
            "例假日起點發車時間\n" +
            "0600\t1200\t1800\n" +
            "0630\t1230\t1830\n" +
            "0700\t1300\t1900\n" +
            "0730\t1330\t1930\n" +
            "0800\t1400\t2000\n" +
            "0830\t1430\t2030\n" +
            "0900\t1500\t2100\n" +
            "0930\t1530\t2130\n" +
            "1000\t1600\t2200\n" +
            "1030\t1630\t2230\n" +
            "1100\t1700\n" +
            "1130\t1730",

            //9025往台北繞駛中央大學    timeTables[5]
            "平常日\n" +
            "中壢端發車時間\n" +
            "1200 1600 1700 1750\n" +
            "預估中央大學抵達時間\n" +
            "1220 1620 1720 1810\n" +
            "\n" +
            "例假日\n" +
            "中壢端發車時間\n" +
            "0717 0730 1630 1815\n" +
            "預估中央大學抵達時間\n" +
            "0737 0750 1650 1835",

            //9025往中壢繞駛中央大學    timeTables[6]
            "平常日\n" +
            "松山機場端發車時間\n" +
            "0637 0710 0750 1230\n" +
            "預估中央大學抵達時間\n" +
            "0747 0820 0900 1340\n" +
            "\n" +
            "例假日\n" +
            "松山機場端發車時間\n" +
            "0730 1810 1900 1945\n" +
            "預估中央大學抵達時間\n" +
            "0840 1920 2010 2055"};

    public static String announcement =
            "Version：v1.1\n" +
            "License：MIT License\n" +
            "Repository：https://github.com/NCU-CC/NCU-BUS\n" +
            "Contributors：蔡宇傑、杜祐興、xxx663xxx\n" +
            "Owner：National Central University, Computer Center\n" +
            "Url：https://www.cc.ncu.edu.tw\n" +
            "Email：mobile@cc.ncu.edu.tw";
}
